app/views/carts/show.html.erb

SELECT  "items".* FROM "items" INNER JOIN "join_cart_items" ON "items"."id" = "join_cart_items"."item_id" WHERE "join_cart_items"."cart_id" = $1 ORDER BY "items"."id" ASC LIMIT $2  [["cart_id", 20], ["LIMIT", 1]]
---
<h1> My cart</h1>
<% @cart.items.each do |x| %>