app/views/items/index.html.erb

SELECT "items".* FROM "items"
---
<% Item.all.each do |x| %>