app/controllers/carts_controller.rb

  def show
    @cart = Cart.find_by(user_id: current_user.id)
---
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 20], ["LIMIT", 1]]

  def update
    @carti = Cart.find_by(user_id: current_user.id)
    @itemi = Item.find(params[:id])
---
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 28], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]