app/controllers/carts_controller.rb

SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 27], ["LIMIT", 1]]
---
  def destroy
    Cart.find_by(user_id: current_user.id).items << Item.find(params[:id])