app/controllers/orders_controller.rb

SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 44], ["LIMIT", 1]]
INSERT INTO "orders" ("created_at", "updated_at", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2019-11-28 14:24:15.499787"], ["updated_at", "2019-11-28 14:24:15.499787"], ["user_id", 44]]
INSERT INTO "join_order_items" ("created_at", "updated_at", "order_id", "item_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2019-11-28 14:11:17.814769"], ["updated_at", "2019-11-28 14:11:17.814769"], ["order_id", 9], ["item_id", 3]]
SELECT "items".* FROM "items" INNER JOIN "join_cart_items" ON "items"."id" = "join_cart_items"."item_id" WHERE "join_cart_items"."cart_id" = $1  [["cart_id", 37]]
DELETE FROM "join_cart_items" WHERE "join_cart_items"."id" = $1  [["id", 142]]
SELECT "join_cart_items".* FROM "join_cart_items" WHERE "join_cart_items"."cart_id" = $1  [["cart_id", 39]]
---
  def create
    @kart = Cart.find_by(user_id: current_user.id)
    @order = Order.create(user: current_user)
    @order.items << @kart.items

    JoinCartItem.where(cart_id: @kart.id).destroy_all