app/models/user.rb

INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 37], ["created_at", "2019-11-28 13:49:17.415860"], ["updated_at", "2019-11-28 13:49:17.415860"]]
INSERT INTO "join_cart_items" ("created_at", "updated_at", "cart_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2019-11-28 13:49:17.460815"], ["updated_at", "2019-11-28 13:49:17.460815"], ["cart_id", 32]]
---
def set_cart
  @cart = Cart.create(user_id: self.id)
  @j = JoinCartItem.create(cart: self.cart)